{
  "architecture": {
    "backend": "tensorflow",
    "class_name": "Functional",
    "config": {
      "input_layers": [
        [
          "input_1",
          0,
          0
        ]
      ],
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              null,
              81,
              1
            ],
            "dtype": "float32",
            "name": "input_1",
            "ragged": false,
            "sparse": false
          },
          "inbound_nodes": [],
          "name": "input_1"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "dtype": "float32",
            "filters": 16,
            "groups": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "conv_1_conv",
            "padding": "valid",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "input_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv_1_conv"
        },
        {
          "class_name": "Activation",
          "config": {
            "activation": "elu",
            "dtype": "float32",
            "name": "conv_1_activation",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv_1_conv",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv_1_activation"
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "data_format": "channels_last",
            "dtype": "float32",
            "name": "conv_1_max_pooling",
            "padding": "valid",
            "pool_size": [
              1,
              3
            ],
            "strides": [
              1,
              3
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv_1_activation",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv_1_max_pooling"
        },
        {
          "class_name": "Dropout",
          "config": {
            "dtype": "float32",
            "name": "conv_1_dropout",
            "noise_shape": null,
            "rate": 0.1,
            "seed": null,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv_1_max_pooling",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv_1_dropout"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "dtype": "float32",
            "filters": 16,
            "groups": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              3,
              3
            ],
            "name": "conv_2_conv",
            "padding": "valid",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "conv_1_dropout",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv_2_conv"
        },
        {
          "class_name": "Activation",
          "config": {
            "activation": "elu",
            "dtype": "float32",
            "name": "conv_2_activation",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv_2_conv",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv_2_activation"
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "data_format": "channels_last",
            "dtype": "float32",
            "name": "conv_2_max_pooling",
            "padding": "valid",
            "pool_size": [
              1,
              3
            ],
            "strides": [
              1,
              3
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv_2_activation",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv_2_max_pooling"
        },
        {
          "class_name": "Dropout",
          "config": {
            "dtype": "float32",
            "name": "conv_2_dropout",
            "noise_shape": null,
            "rate": 0.1,
            "seed": null,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv_2_max_pooling",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv_2_dropout"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "dtype": "float32",
            "filters": 16,
            "groups": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              1,
              8
            ],
            "name": "conv_3_conv",
            "padding": "valid",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "conv_2_dropout",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv_3_conv"
        },
        {
          "class_name": "Activation",
          "config": {
            "activation": "elu",
            "dtype": "float32",
            "name": "conv_3_activation",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv_3_conv",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv_3_activation"
        },
        {
          "class_name": "Dropout",
          "config": {
            "dtype": "float32",
            "name": "conv_3_dropout",
            "noise_shape": null,
            "rate": 0.1,
            "seed": null,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv_3_activation",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv_3_dropout"
        },
        {
          "class_name": "Reshape",
          "config": {
            "dtype": "float32",
            "name": "tcn_input_reshape",
            "target_shape": [
              -1,
              16
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv_3_dropout",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "tcn_input_reshape"
        },
        {
          "class_name": "Conv1D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1
            ],
            "dtype": "float32",
            "filters": 16,
            "groups": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              5
            ],
            "name": "tcn_dilation_1_dilated_conv",
            "padding": "same",
            "strides": [
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "tcn_input_reshape",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "tcn_dilation_1_dilated_conv"
        },
        {
          "class_name": "Activation",
          "config": {
            "activation": "elu",
            "dtype": "float32",
            "name": "tcn_dilation_1_activation",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "tcn_dilation_1_dilated_conv",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "tcn_dilation_1_activation"
        },
        {
          "class_name": "SpatialDropout1D",
          "config": {
            "dtype": "float32",
            "name": "tcn_dilation_1_spatial_dropout_0.100000",
            "noise_shape": null,
            "rate": 0.1,
            "seed": null,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "tcn_dilation_1_activation",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "tcn_dilation_1_spatial_dropout_0.100000"
        },
        {
          "class_name": "Conv1D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1
            ],
            "dtype": "float32",
            "filters": 16,
            "groups": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              1
            ],
            "name": "tcn_dilation_1_1x1_conv_residual",
            "padding": "same",
            "strides": [
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "tcn_input_reshape",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "tcn_dilation_1_1x1_conv_residual"
        },
        {
          "class_name": "Conv1D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1
            ],
            "dtype": "float32",
            "filters": 16,
            "groups": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              1
            ],
            "name": "tcn_dilation_1_1x1_conv",
            "padding": "same",
            "strides": [
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "tcn_dilation_1_spatial_dropout_0.100000",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "tcn_dilation_1_1x1_conv"
        },
        {
          "class_name": "Add",
          "config": {
            "dtype": "float32",
            "name": "tcn_dilation_1_merge_residual",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "tcn_dilation_1_1x1_conv_residual",
                0,
                0,
                {}
              ],
              [
                "tcn_dilation_1_1x1_conv",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "tcn_dilation_1_merge_residual"
        },
        {
          "class_name": "Conv1D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              2
            ],
            "dtype": "float32",
            "filters": 16,
            "groups": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              5
            ],
            "name": "tcn_dilation_2_dilated_conv",
            "padding": "same",
            "strides": [
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "tcn_dilation_1_merge_residual",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "tcn_dilation_2_dilated_conv"
        },
        {
          "class_name": "Activation",
          "config": {
            "activation": "elu",
            "dtype": "float32",
            "name": "tcn_dilation_2_activation",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "tcn_dilation_2_dilated_conv",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "tcn_dilation_2_activation"
        },
        {
          "class_name": "SpatialDropout1D",
          "config": {
            "dtype": "float32",
            "name": "tcn_dilation_2_spatial_dropout_0.100000",
            "noise_shape": null,
            "rate": 0.1,
            "seed": null,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "tcn_dilation_2_activation",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "tcn_dilation_2_spatial_dropout_0.100000"
        },
        {
          "class_name": "Conv1D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1
            ],
            "dtype": "float32",
            "filters": 16,
            "groups": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              1
            ],
            "name": "tcn_dilation_2_1x1_conv_residual",
            "padding": "same",
            "strides": [
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "tcn_dilation_1_merge_residual",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "tcn_dilation_2_1x1_conv_residual"
        },
        {
          "class_name": "Conv1D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1
            ],
            "dtype": "float32",
            "filters": 16,
            "groups": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              1
            ],
            "name": "tcn_dilation_2_1x1_conv",
            "padding": "same",
            "strides": [
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "tcn_dilation_2_spatial_dropout_0.100000",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "tcn_dilation_2_1x1_conv"
        },
        {
          "class_name": "Add",
          "config": {
            "dtype": "float32",
            "name": "tcn_dilation_2_merge_residual",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "tcn_dilation_2_1x1_conv_residual",
                0,
                0,
                {}
              ],
              [
                "tcn_dilation_2_1x1_conv",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "tcn_dilation_2_merge_residual"
        },
        {
          "class_name": "Conv1D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              4
            ],
            "dtype": "float32",
            "filters": 16,
            "groups": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              5
            ],
            "name": "tcn_dilation_4_dilated_conv",
            "padding": "same",
            "strides": [
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "tcn_dilation_2_merge_residual",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "tcn_dilation_4_dilated_conv"
        },
        {
          "class_name": "Activation",
          "config": {
            "activation": "elu",
            "dtype": "float32",
            "name": "tcn_dilation_4_activation",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "tcn_dilation_4_dilated_conv",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "tcn_dilation_4_activation"
        },
        {
          "class_name": "SpatialDropout1D",
          "config": {
            "dtype": "float32",
            "name": "tcn_dilation_4_spatial_dropout_0.100000",
            "noise_shape": null,
            "rate": 0.1,
            "seed": null,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "tcn_dilation_4_activation",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "tcn_dilation_4_spatial_dropout_0.100000"
        },
        {
          "class_name": "Conv1D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1
            ],
            "dtype": "float32",
            "filters": 16,
            "groups": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              1
            ],
            "name": "tcn_dilation_4_1x1_conv_residual",
            "padding": "same",
            "strides": [
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "tcn_dilation_2_merge_residual",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "tcn_dilation_4_1x1_conv_residual"
        },
        {
          "class_name": "Conv1D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1
            ],
            "dtype": "float32",
            "filters": 16,
            "groups": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              1
            ],
            "name": "tcn_dilation_4_1x1_conv",
            "padding": "same",
            "strides": [
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "tcn_dilation_4_spatial_dropout_0.100000",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "tcn_dilation_4_1x1_conv"
        },
        {
          "class_name": "Add",
          "config": {
            "dtype": "float32",
            "name": "tcn_dilation_4_merge_residual",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "tcn_dilation_4_1x1_conv_residual",
                0,
                0,
                {}
              ],
              [
                "tcn_dilation_4_1x1_conv",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "tcn_dilation_4_merge_residual"
        },
        {
          "class_name": "Conv1D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              8
            ],
            "dtype": "float32",
            "filters": 16,
            "groups": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              5
            ],
            "name": "tcn_dilation_8_dilated_conv",
            "padding": "same",
            "strides": [
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "tcn_dilation_4_merge_residual",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "tcn_dilation_8_dilated_conv"
        },
        {
          "class_name": "Activation",
          "config": {
            "activation": "elu",
            "dtype": "float32",
            "name": "tcn_dilation_8_activation",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "tcn_dilation_8_dilated_conv",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "tcn_dilation_8_activation"
        },
        {
          "class_name": "SpatialDropout1D",
          "config": {
            "dtype": "float32",
            "name": "tcn_dilation_8_spatial_dropout_0.100000",
            "noise_shape": null,
            "rate": 0.1,
            "seed": null,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "tcn_dilation_8_activation",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "tcn_dilation_8_spatial_dropout_0.100000"
        },
        {
          "class_name": "Conv1D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1
            ],
            "dtype": "float32",
            "filters": 16,
            "groups": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              1
            ],
            "name": "tcn_dilation_8_1x1_conv_residual",
            "padding": "same",
            "strides": [
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "tcn_dilation_4_merge_residual",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "tcn_dilation_8_1x1_conv_residual"
        },
        {
          "class_name": "Conv1D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1
            ],
            "dtype": "float32",
            "filters": 16,
            "groups": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              1
            ],
            "name": "tcn_dilation_8_1x1_conv",
            "padding": "same",
            "strides": [
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "tcn_dilation_8_spatial_dropout_0.100000",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "tcn_dilation_8_1x1_conv"
        },
        {
          "class_name": "Add",
          "config": {
            "dtype": "float32",
            "name": "tcn_dilation_8_merge_residual",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "tcn_dilation_8_1x1_conv_residual",
                0,
                0,
                {}
              ],
              [
                "tcn_dilation_8_1x1_conv",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "tcn_dilation_8_merge_residual"
        },
        {
          "class_name": "Conv1D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              16
            ],
            "dtype": "float32",
            "filters": 16,
            "groups": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              5
            ],
            "name": "tcn_dilation_16_dilated_conv",
            "padding": "same",
            "strides": [
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "tcn_dilation_8_merge_residual",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "tcn_dilation_16_dilated_conv"
        },
        {
          "class_name": "Activation",
          "config": {
            "activation": "elu",
            "dtype": "float32",
            "name": "tcn_dilation_16_activation",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "tcn_dilation_16_dilated_conv",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "tcn_dilation_16_activation"
        },
        {
          "class_name": "SpatialDropout1D",
          "config": {
            "dtype": "float32",
            "name": "tcn_dilation_16_spatial_dropout_0.100000",
            "noise_shape": null,
            "rate": 0.1,
            "seed": null,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "tcn_dilation_16_activation",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "tcn_dilation_16_spatial_dropout_0.100000"
        },
        {
          "class_name": "Conv1D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1
            ],
            "dtype": "float32",
            "filters": 16,
            "groups": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              1
            ],
            "name": "tcn_dilation_16_1x1_conv_residual",
            "padding": "same",
            "strides": [
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "tcn_dilation_8_merge_residual",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "tcn_dilation_16_1x1_conv_residual"
        },
        {
          "class_name": "Conv1D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1
            ],
            "dtype": "float32",
            "filters": 16,
            "groups": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              1
            ],
            "name": "tcn_dilation_16_1x1_conv",
            "padding": "same",
            "strides": [
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "tcn_dilation_16_spatial_dropout_0.100000",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "tcn_dilation_16_1x1_conv"
        },
        {
          "class_name": "Add",
          "config": {
            "dtype": "float32",
            "name": "tcn_dilation_16_merge_residual",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "tcn_dilation_16_1x1_conv_residual",
                0,
                0,
                {}
              ],
              [
                "tcn_dilation_16_1x1_conv",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "tcn_dilation_16_merge_residual"
        },
        {
          "class_name": "Conv1D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              32
            ],
            "dtype": "float32",
            "filters": 16,
            "groups": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              5
            ],
            "name": "tcn_dilation_32_dilated_conv",
            "padding": "same",
            "strides": [
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "tcn_dilation_16_merge_residual",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "tcn_dilation_32_dilated_conv"
        },
        {
          "class_name": "Activation",
          "config": {
            "activation": "elu",
            "dtype": "float32",
            "name": "tcn_dilation_32_activation",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "tcn_dilation_32_dilated_conv",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "tcn_dilation_32_activation"
        },
        {
          "class_name": "SpatialDropout1D",
          "config": {
            "dtype": "float32",
            "name": "tcn_dilation_32_spatial_dropout_0.100000",
            "noise_shape": null,
            "rate": 0.1,
            "seed": null,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "tcn_dilation_32_activation",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "tcn_dilation_32_spatial_dropout_0.100000"
        },
        {
          "class_name": "Conv1D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1
            ],
            "dtype": "float32",
            "filters": 16,
            "groups": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              1
            ],
            "name": "tcn_dilation_32_1x1_conv_residual",
            "padding": "same",
            "strides": [
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "tcn_dilation_16_merge_residual",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "tcn_dilation_32_1x1_conv_residual"
        },
        {
          "class_name": "Conv1D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1
            ],
            "dtype": "float32",
            "filters": 16,
            "groups": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              1
            ],
            "name": "tcn_dilation_32_1x1_conv",
            "padding": "same",
            "strides": [
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "tcn_dilation_32_spatial_dropout_0.100000",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "tcn_dilation_32_1x1_conv"
        },
        {
          "class_name": "Add",
          "config": {
            "dtype": "float32",
            "name": "tcn_dilation_32_merge_residual",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "tcn_dilation_32_1x1_conv_residual",
                0,
                0,
                {}
              ],
              [
                "tcn_dilation_32_1x1_conv",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "tcn_dilation_32_merge_residual"
        },
        {
          "class_name": "Conv1D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              64
            ],
            "dtype": "float32",
            "filters": 16,
            "groups": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              5
            ],
            "name": "tcn_dilation_64_dilated_conv",
            "padding": "same",
            "strides": [
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "tcn_dilation_32_merge_residual",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "tcn_dilation_64_dilated_conv"
        },
        {
          "class_name": "Activation",
          "config": {
            "activation": "elu",
            "dtype": "float32",
            "name": "tcn_dilation_64_activation",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "tcn_dilation_64_dilated_conv",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "tcn_dilation_64_activation"
        },
        {
          "class_name": "SpatialDropout1D",
          "config": {
            "dtype": "float32",
            "name": "tcn_dilation_64_spatial_dropout_0.100000",
            "noise_shape": null,
            "rate": 0.1,
            "seed": null,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "tcn_dilation_64_activation",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "tcn_dilation_64_spatial_dropout_0.100000"
        },
        {
          "class_name": "Conv1D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1
            ],
            "dtype": "float32",
            "filters": 16,
            "groups": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              1
            ],
            "name": "tcn_dilation_64_1x1_conv_residual",
            "padding": "same",
            "strides": [
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "tcn_dilation_32_merge_residual",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "tcn_dilation_64_1x1_conv_residual"
        },
        {
          "class_name": "Conv1D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1
            ],
            "dtype": "float32",
            "filters": 16,
            "groups": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              1
            ],
            "name": "tcn_dilation_64_1x1_conv",
            "padding": "same",
            "strides": [
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "tcn_dilation_64_spatial_dropout_0.100000",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "tcn_dilation_64_1x1_conv"
        },
        {
          "class_name": "Add",
          "config": {
            "dtype": "float32",
            "name": "tcn_dilation_64_merge_residual",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "tcn_dilation_64_1x1_conv_residual",
                0,
                0,
                {}
              ],
              [
                "tcn_dilation_64_1x1_conv",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "tcn_dilation_64_merge_residual"
        },
        {
          "class_name": "Conv1D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              128
            ],
            "dtype": "float32",
            "filters": 16,
            "groups": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              5
            ],
            "name": "tcn_dilation_128_dilated_conv",
            "padding": "same",
            "strides": [
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "tcn_dilation_64_merge_residual",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "tcn_dilation_128_dilated_conv"
        },
        {
          "class_name": "Activation",
          "config": {
            "activation": "elu",
            "dtype": "float32",
            "name": "tcn_dilation_128_activation",
            "trainable": true
          },
          "inbound_nodes": [
            [
